Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxMtu_cfg_TC39xB.c
const IfxMtu_MbistSshConfig     mbistSshConfigGang4[] = {
    {
        IfxMtu_MbistSel_cpu0Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu1Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmDpll2,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x3F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang6[] = {
    {
        IfxMtu_MbistSel_lmu0,                                   /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Dlmu,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x3F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmFifo,                                /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0xF,                                                    /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang7[] = {
    {
        IfxMtu_MbistSel_cpu2Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x6F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmMcs0Slow,                            /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x1F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang8[] = {
    {
        IfxMtu_MbistSel_cpu3Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x6F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu4Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x6F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang9[] = {
    {
        IfxMtu_MbistSel_cpu5Dspr,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x6F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_spu0Config,                             /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x3F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_spu1Config,                             /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x3F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmMcs1Slow,                            /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x0F,                                                   /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        1                                                       /* preClearEnable  */
    }
};
const IfxMtu_MbistSshConfig     mbistSshConfigGang10[] = {
    {
        IfxMtu_MbistSel_cpu3Dlmu,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x3F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu4Dlmu,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x3F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu5Dlmu,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x3F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang11[] = {
    {
        IfxMtu_MbistSel_cpu1Dlmu,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x3F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Dlmu,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x3F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmMcs0Fast,                             /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x1F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        1                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmMcs1Fast,                             /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x0F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        1                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_psi5,                                    /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x03,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        1                                                        /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang12[] = {
    {
        IfxMtu_MbistSel_cpu1Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu3Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang13[] = {
    {
        IfxMtu_MbistSel_cpu4Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu5Pspr,                                /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x2F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        0                                                        /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_mcds,                                    /* sshSel          */
        0x00,                                                    /* lowAddress      */
        0x0F,                                                    /* highAddress     */
        5,                                                       /* uncorrectableErrorThreshold*/
        1                                                        /* preClearEnable  */
    },

    {
        IfxMtu_MbistSel_cpu0Ptag,                               /* sshSel          */
        0x00,                                                   /* lowAddress      */
        0x7,                                                    /* highAddress     */
        5,                                                      /* uncorrectableErrorThreshold*/
        0                                                       /* preClearEnable  */
    }
};

